# SetColor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPositionColored..::..SetColor Method
VertexPositionColored Class See Also
---
Sets the vertex's color.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetColor(
	ColorWithTransparency color
)
```

Visual Basic
---
```text
Public Sub SetColor ( _
	color As ColorWithTransparency _
)
```

Visual C++
---
```text
public:
void SetColor(
	ColorWithTransparency^ color
)
```

# ### Parameters
color
    Type: Autodesk.Revit.DB..::..ColorWithTransparency The vertex's color.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace